# GetFailuresPreprocessor Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureHandlingOptions..::..GetFailuresPreprocessor Method
FailureHandlingOptions Class See Also
---
Gets the callback to be invoked in the beginning of failure processing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IFailuresPreprocessor GetFailuresPreprocessor()
```

Visual Basic
---
```text
Public Function GetFailuresPreprocessor As IFailuresPreprocessor
```

Visual C++
---
```text
public:
IFailuresPreprocessor^ GetFailuresPreprocessor()
```

# ### Return Value
The callback to be invoked in the beginning of failure processing.
# See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace